### Groupby

In [103]:
data = {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB','GOOG'],
       'Nome':['Sam','Charlie','Amy','Vanessa','Carl','Sarah','Amy'],
       'Venda':[200,120,340,124,243,350,100]}

In [104]:
df = pd.DataFrame(data)

In [105]:
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350
6    GOOG      Amy    100

Vamos agrupar pela empresa

In [106]:
group = df.groupby("Empresa")

Ver o total vendido por empresa usamos o metodo sum() ou a media mean().

In [107]:
group.sum()

         Venda
Empresa
FB         593
GOOG       420
MSFT       464

In [108]:
group.mean()

         Venda
Empresa
FB       296.5
GOOG     140.0
MSFT     232.0

In [113]:
group.count()

         Nome  Venda
Empresa
FB          2      2
GOOG        3      3
MSFT        2      2

Para ter uma descrição geral do DF usamos o describe()

In [109]:
group.describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      3.0  140.0   52.915026  100.0  110.00  120.0  160.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [110]:
group_name = df.groupby("Nome")

In [111]:
group_name.describe()

        Venda
        count   mean         std    min    25%    50%    75%    max
Nome
Amy       2.0  220.0  169.705627  100.0  160.0  220.0  280.0  340.0
Carl      1.0  243.0         NaN  243.0  243.0  243.0  243.0  243.0
Charlie   1.0  120.0         NaN  120.0  120.0  120.0  120.0  120.0
Sam       1.0  200.0         NaN  200.0  200.0  200.0  200.0  200.0
Sarah     1.0  350.0         NaN  350.0  350.0  350.0  350.0  350.0
Vanessa   1.0  124.0         NaN  124.0  124.0  124.0  124.0  124.0

Somar o total de vendas por vendedor

In [112]:
group_name.sum()

         Venda
Nome
Amy        440
Carl       243
Charlie    120
Sam        200
Sarah      350
Vanessa    124

In [114]:
group_name.count()

         Empresa  Venda
Nome
Amy            2      2
Carl           1      1
Charlie        1      1
Sam            1      1
Sarah          1      1
Vanessa        1      1

Localizar vendas de um determinado vendendor

In [116]:
group_name.sum().loc['Amy']

Venda    440
Name: Amy, dtype: int64